Repository: dimchanov/LinuxApplicationDevelopment
Catalog: 12_InstallPackaging/src/*.po
Languages: ru

source: -h
ru: -п

source: --help
ru: --помощь

source: A rather stupid C program that guesses the number
ru: Довольно глупая программа на Си, которая угадывает число

source: Args usage:
ru: Использование аргументов:

source: -h, --help Prints the usage for the executable and exits.
ru: -п, --помощь Выводит данные об использовании исполняемого файла и завершает работу.

source: -r Enables roman numbers.
ru: -р Включает римские цифры.

source: -r
ru: -р

source: Roman numerals are used
ru: Используются римские цифры

source: Unknown command line argument
ru: Неизвестный аргумент командной строки

source: Please guess the number from %s
ru: Пожалуйста, угадайте число от %s

source: to %s
ru: до %s

source: Is your number greater than %s?
ru: Ваш номер больше, чем %s?

source: yes
ru: да

source: y
ru: д

source: no
ru: нет

source: n
ru: н

source: Just answer the question yes or no, please
ru: Пожалуйста, отвечайте на вопрос да или нет

source: Your number is %s
ru: Ваше число %s
